Lazarus/httpFolderPoster/outputFolder/Pattern3.xml

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 1/13/2015 11:31:48 AM: Generated with wsdlStub 8.0.2.7848 by Jan -->
<soapenv:Envelope
 xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
 xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 >
  <soapenv:Header>
    <ns4:RaboHeader xmlns:ns4="http://www.rabobank.nl/XMLHeader/10">
      <ns4:HeaderVersion>3</ns4:HeaderVersion>
      <ns4:MessageId>MessageId</ns4:MessageId>
      <ns4:ServiceRequestorDomain>ServiceRequestorDomain</ns4:ServiceRequestorDomain>
      <ns4:ServiceRequestorId>ServiceRequestorId</ns4:ServiceRequestorId>
      <ns4:ServiceProviderDomain>ServiceProviderDomain</ns4:ServiceProviderDomain>
      <ns4:ServiceId>ServiceId</ns4:ServiceId>
      <ns4:ServiceVersion>Ser</ns4:ServiceVersion>
      <ns4:FaultIndication>False</ns4:FaultIndication>
      <ns4:MessageTimestamp>2015-01-13T11:31:48.974</ns4:MessageTimestamp>
    </ns4:RaboHeader>
  </soapenv:Header>
  <soapenv:Body>
    <ns2:RaadplegenServiceAanvraag_Rpy xmlns:ns2="http://www.rabobank.nl/CRM/CRMI/RaadplegenServiceAanvraag/1/Rpy">
      <ns2:KlantenLijst>
        <ns2:Klant>
          <ns2:KlantId>janbo</ns2:KlantId>
          <ns2:KantoorNummer>7</ns2:KantoorNummer>
          <ns2:ServiceAanvragenLijst>
            <ns2:ServiceAanvraag>
              <ns2:ServiceAanvraagNummer>varjb</ns2:ServiceAanvraagNummer>
              <ns2:MedewerkerId>1</ns2:MedewerkerId>
              <ns2:ServiceAanvraagType>12</ns2:ServiceAanvraagType>
              <ns2:Medium>12</ns2:Medium>
              <ns2:Categorie>Ctgr</ns2:Categorie>
              <ns2:Opmerking>Opm</ns2:Opmerking>
              <ns2:BeginDatum>2013-11-02</ns2:BeginDatum>
              <ns2:BronSysteem>BS</ns2:BronSysteem>
              <ns2:ActiviteitenLijst>
                <ns2:Activiteit>
                  <ns2:ActiviteitType>1111</ns2:ActiviteitType>
                  <ns2:Beschrijving>Beschrijving</ns2:Beschrijving>
                  <ns2:Status>Status</ns2:Status>
                  <ns2:StartMoment>2010-12-11</ns2:StartMoment>
                  <ns2:BronSysteem>BronSysteem</ns2:BronSysteem>
                  <ns2:BronActiviteit>BronActiviteit</ns2:BronActiviteit>
                  <ns2:MedewerkerId>MedewerkerId</ns2:MedewerkerId>
                </ns2:Activiteit>
                <ns2:Activiteit>
                  <ns2:ActiviteitType>222</ns2:ActiviteitType>
                  <ns2:Beschrijving>Beschrijving</ns2:Beschrijving>
                  <ns2:Status>Status</ns2:Status>
                  <ns2:StartMoment>2010-12-11</ns2:StartMoment>
                  <ns2:BronSysteem>BronSysteem</ns2:BronSysteem>
                  <ns2:BronActiviteit>BronActiviteit</ns2:BronActiviteit>
                  <ns2:MedewerkerId>MedewerkerId</ns2:MedewerkerId>
                </ns2:Activiteit>
              </ns2:ActiviteitenLijst>
            </ns2:ServiceAanvraag>
          </ns2:ServiceAanvragenLijst>
        </ns2:Klant>
      </ns2:KlantenLijst>
    </ns2:RaadplegenServiceAanvraag_Rpy>
  </soapenv:Body>
</soapenv:Envelope>
